src/test/resources/data/CucumberTest/QBTDC-InvalidOrder.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soap:Header>
        <wsse:Security soap:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>LMX-wrgvnAvwtfHCaZFEYfin</wsse:Username>
                <wsse:Password>IVqBjJQXpzi6TFCW5Ngg</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <QBTDC xmlns="http://wag.btireland.ie/WAG_WS/">
            <VERSION>1.0</VERSION>
            <ORDER>
                <HEADER>
                    <DATA_CONTRACT_NAME>WAG</DATA_CONTRACT_NAME>
                    <ORIGINATOR_CODE>EXT</ORIGINATOR_CODE>
                    <TRANSACTION_ID>0</TRANSACTION_ID>
                    <DATE_TIME_STAMP>26/10/2022 12:32:56</DATE_TIME_STAMP>
                </HEADER>
                <ORDER_DATA>
                    <OPERATOR_DETAILS>
                        <NAME>LMX</NAME>
                        <CODE>7026</CODE>
                    </OPERATOR_DETAILS>
                    <ORDER_DETAILS>
                        <SYNC_REQUIRED>Y</SYNC_REQUIRED>
                        <ORDER_NUMBER>AUTOGENERATE</ORDER_NUMBER>
                        <TYPE>QBTDC</TYPE>
                        <APPLICATION_DATE>26/10/2022</APPLICATION_DATE>
                        <PROJECT_KEY>VODA_01</PROJECT_KEY>
                        <OBO>vodafone</OBO>
                        <RECURRING_FREQUENCY>ANNUAL</RECURRING_FREQUENCY>

                    </ORDER_DETAILS>
                    <QUOTE_ITEM_REQUEST>
                        <PRODUCT>WIC</PRODUCT>
                        <TERM>1</TERM>
                        <IP>
                            <IP_RANGE>31</IP_RANGE>
                        </IP>
                        <LOGICAL>
                            <ACTION_FLAG>P</ACTION_FLAG>
                            <BANDWIDTH>10000</BANDWIDTH>
                            <PROFILE>PREMIUM_100</PROFILE>
                        </LOGICAL>
                        <A_END>
                            <LOCATION>
                                <EIRCODE>D17XD78</EIRCODE>
                            </LOCATION>
                            <ACCESS>
                                <ACTION_FLAG>P</ACTION_FLAG>
                                <!--<ACCESS_SUPPLIER>OFF-NET</ACCESS_SUPPLIER>-->
                                <BANDWIDTH>10</BANDWIDTH>
                                <SLA>STANDARD</SLA>
                            </ACCESS>
                        </A_END>
                        <B_END>
                            <LOCATION>
                                <HANDOVER_NODE>INTERNET</HANDOVER_NODE>
                            </LOCATION>
                            <ACCESS>
                                <ACTION_FLAG>CH</ACTION_FLAG>
                            </ACCESS>
                        </B_END>
                    </QUOTE_ITEM_REQUEST>



                </ORDER_DATA>
            </ORDER>
        </QBTDC>
    </soap:Body>
</soap:Envelope>